app/controllers/tweets_controller.rb

  def index
    @tweets = Tweet.includes(:user).page(params[:page]).per(5).order("created_at DESC")
---
SELECT  `tweets`.* FROM `tweets`  ORDER BY created_at DESC LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM `tweets`
SELECT `users`.* FROM `users` WHERE `users`.`id` IN (1)

  def create
    Tweet.create(image: tweet_params[:image], text: tweet_params[:text], user_id: current_user.id)
---
INSERT INTO `tweets` (`name`, `image`, `text`, `user_id`, `created_at`, `updated_at`) VALUES ('りょう', 'https://www.photock.jp/photo/middle/photo0000-0360.jpg', 'こんにちは', 1, '2018-08-31 07:02:17', '2018-08-31 07:02:17')

  def destroy
    tweet = Tweet.find(params[:id])
    tweet.destroy if tweet.user_id == current_user.id
---
SELECT  `tweets`.* FROM `tweets` WHERE `tweets`.`id` = 13 LIMIT 1
DELETE FROM `tweets` WHERE `tweets`.`id` = 13

  def update
    tweet = Tweet.find(params[:id])
    if tweet.user_id == current_user.id
      tweet.update(tweet_params)
---
SELECT  `tweets`.* FROM `tweets` WHERE `tweets`.`id` = 17 LIMIT 1
UPDATE `tweets` SET `text` = 'こんにちは\r\n雷ですね！', `updated_at` = '2018-08-31 10:17:01' WHERE `tweets`.`id` = 17

  def show
    @tweet = Tweet.find(params[:id])
    @comments = @tweet.comments.includes(:user)
---
SELECT  `tweets`.* FROM `tweets` WHERE `tweets`.`id` = 17 LIMIT 1
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1  ORDER BY `users`.`id` ASC LIMIT 1
SELECT `comments`.* FROM `comments` WHERE `comments`.`tweet_id` = 10